keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxMc_reg.h
/** \\brief  EC, Read Data and Bit Flip Register */
#define MC1_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611ECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC1_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611EEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC1_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611A8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC1_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611AAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC1_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611ACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC1_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611AEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC1_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611B0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC1_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00611B2u)

/** \\brief  C, Revision ID Register */
#define MC1_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006110Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc2
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC2_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0061200u)

/** \\brief  2, Configuration Register 1 */
#define MC2_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0061202u)

/** \\brief  10, Memory ECC Detection Register */
#define MC2_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0061210u)

/** \\brief  E, ECC Safety Register */
#define MC2_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006120Eu)

/** \\brief  12, Error Tracking Register */
#define MC2_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061212u)

/** \\brief  14, Error Tracking Register */
#define MC2_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061214u)

/** \\brief  16, Error Tracking Register */
#define MC2_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061216u)

/** \\brief  18, Error Tracking Register */
#define MC2_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061218u)

/** \\brief  1A, Error Tracking Register */
#define MC2_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006121Au)

/** \\brief  4, MBIST Control Register */
#define MC2_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0061204u)

/** \\brief  6, Status Register */
#define MC2_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0061206u)

/** \\brief  8, Range Register, single address mode */
#define MC2_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0061208u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC2_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC2_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC2_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC2_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC2_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC2_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC2_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC2_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC2_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC2_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC2_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC2_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC2_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC2_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC2_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC2_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC2_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC2_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC2_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC2_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC2_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC2_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC2_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC2_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC2_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC2_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC2_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC2_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC2_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC2_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00612E6u)

