keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC13_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DE8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC13_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DEAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC13_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC13_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DEEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC13_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DA8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC13_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DAAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC13_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC13_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DAEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC13_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DB0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC13_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061DB2u)

/** \\brief  C, Revision ID Register */
#define MC13_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0061D0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc14
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC14_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0061E00u)

/** \\brief  2, Configuration Register 1 */
#define MC14_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0061E02u)

/** \\brief  10, Memory ECC Detection Register */
#define MC14_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0061E10u)

/** \\brief  E, ECC Safety Register */
#define MC14_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF0061E0Eu)

/** \\brief  12, Error Tracking Register */
#define MC14_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061E12u)

/** \\brief  14, Error Tracking Register */
#define MC14_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061E14u)

/** \\brief  16, Error Tracking Register */
#define MC14_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061E16u)

/** \\brief  18, Error Tracking Register */
#define MC14_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061E18u)

/** \\brief  1A, Error Tracking Register */
#define MC14_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0061E1Au)

/** \\brief  4, MBIST Control Register */
#define MC14_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0061E04u)

/** \\brief  6, Status Register */
#define MC14_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0061E06u)

/** \\brief  8, Range Register, single address mode */
#define MC14_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0061E08u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC14_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061EA0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC14_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061EA2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC14_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061EB4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC14_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061EB6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC14_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061EB8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC14_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061EBAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC14_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061EBCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC14_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061EBEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC14_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061EC0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC14_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061EC2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC14_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061EC4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC14_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061EC6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC14_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061EA4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC14_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061EC8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC14_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061ECAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC14_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061ECCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC14_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061ECEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC14_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061ED0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC14_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061ED2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC14_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061ED4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC14_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061ED6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC14_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061ED8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC14_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061EDAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC14_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061EA6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC14_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061EDCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC14_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061EDEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC14_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061EE0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC14_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061EE2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC14_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061EE4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC14_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061EE6u)

