keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC15_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FE8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC15_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FEAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC15_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC15_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FEEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC15_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FA8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC15_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FAAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC15_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC15_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FAEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC15_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FB0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC15_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0061FB2u)

/** \\brief  C, Revision ID Register */
#define MC15_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0061F0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc16
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC16_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0062000u)

/** \\brief  2, Configuration Register 1 */
#define MC16_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0062002u)

/** \\brief  10, Memory ECC Detection Register */
#define MC16_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0062010u)

/** \\brief  E, ECC Safety Register */
#define MC16_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006200Eu)

/** \\brief  12, Error Tracking Register */
#define MC16_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062012u)

/** \\brief  14, Error Tracking Register */
#define MC16_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062014u)

/** \\brief  16, Error Tracking Register */
#define MC16_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062016u)

/** \\brief  18, Error Tracking Register */
#define MC16_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062018u)

/** \\brief  1A, Error Tracking Register */
#define MC16_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006201Au)

/** \\brief  4, MBIST Control Register */
#define MC16_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0062004u)

/** \\brief  6, Status Register */
#define MC16_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0062006u)

/** \\brief  8, Range Register, single address mode */
#define MC16_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0062008u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC16_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC16_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC16_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC16_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC16_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC16_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC16_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC16_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC16_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC16_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC16_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC16_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC16_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC16_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC16_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC16_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC16_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC16_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC16_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC16_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC16_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC16_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC16_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC16_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC16_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC16_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC16_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC16_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC16_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC16_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00620E6u)

