keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC21_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00625E8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC21_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00625EAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC21_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00625ECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC21_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00625EEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC21_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00625A8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC21_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00625AAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC21_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00625ACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC21_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00625AEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC21_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00625B0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC21_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00625B2u)

/** \\brief  C, Revision ID Register */
#define MC21_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006250Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc22
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC22_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0062600u)

/** \\brief  2, Configuration Register 1 */
#define MC22_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0062602u)

/** \\brief  10, Memory ECC Detection Register */
#define MC22_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0062610u)

/** \\brief  E, ECC Safety Register */
#define MC22_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006260Eu)

/** \\brief  12, Error Tracking Register */
#define MC22_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062612u)

/** \\brief  14, Error Tracking Register */
#define MC22_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062614u)

/** \\brief  16, Error Tracking Register */
#define MC22_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062616u)

/** \\brief  18, Error Tracking Register */
#define MC22_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062618u)

/** \\brief  1A, Error Tracking Register */
#define MC22_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006261Au)

/** \\brief  4, MBIST Control Register */
#define MC22_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0062604u)

/** \\brief  6, Status Register */
#define MC22_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0062606u)

/** \\brief  8, Range Register, single address mode */
#define MC22_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0062608u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC22_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC22_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC22_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC22_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC22_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC22_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC22_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC22_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC22_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC22_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC22_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC22_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC22_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC22_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC22_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC22_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC22_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC22_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC22_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC22_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC22_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC22_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC22_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC22_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC22_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC22_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC22_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC22_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC22_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC22_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626E6u)

