keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC22_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626E8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC22_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626EAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC22_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626ECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC22_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626EEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC22_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626A8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC22_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626AAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC22_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626ACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC22_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626AEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC22_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626B0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC22_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00626B2u)

/** \\brief  C, Revision ID Register */
#define MC22_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006260Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc23
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC23_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0062700u)

/** \\brief  2, Configuration Register 1 */
#define MC23_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0062702u)

/** \\brief  10, Memory ECC Detection Register */
#define MC23_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0062710u)

/** \\brief  E, ECC Safety Register */
#define MC23_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006270Eu)

/** \\brief  12, Error Tracking Register */
#define MC23_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062712u)

/** \\brief  14, Error Tracking Register */
#define MC23_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062714u)

/** \\brief  16, Error Tracking Register */
#define MC23_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062716u)

/** \\brief  18, Error Tracking Register */
#define MC23_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0062718u)

/** \\brief  1A, Error Tracking Register */
#define MC23_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006271Au)

/** \\brief  4, MBIST Control Register */
#define MC23_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0062704u)

/** \\brief  6, Status Register */
#define MC23_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0062706u)

/** \\brief  8, Range Register, single address mode */
#define MC23_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0062708u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC23_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC23_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC23_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC23_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC23_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC23_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC23_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC23_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC23_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC23_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC23_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC23_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC23_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC23_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC23_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC23_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC23_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC23_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC23_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC23_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC23_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC23_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC23_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC23_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC23_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC23_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC23_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC23_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC23_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC23_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00627E6u)

