keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC31_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FE8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC31_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FEAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC31_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC31_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FEEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC31_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FA8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC31_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FAAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC31_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC31_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FAEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC31_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FB0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC31_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0062FB2u)

/** \\brief  C, Revision ID Register */
#define MC31_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0062F0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc32
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC32_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0063000u)

/** \\brief  2, Configuration Register 1 */
#define MC32_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0063002u)

/** \\brief  10, Memory ECC Detection Register */
#define MC32_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0063010u)

/** \\brief  E, ECC Safety Register */
#define MC32_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006300Eu)

/** \\brief  12, Error Tracking Register */
#define MC32_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063012u)

/** \\brief  14, Error Tracking Register */
#define MC32_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063014u)

/** \\brief  16, Error Tracking Register */
#define MC32_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063016u)

/** \\brief  18, Error Tracking Register */
#define MC32_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063018u)

/** \\brief  1A, Error Tracking Register */
#define MC32_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006301Au)

/** \\brief  4, MBIST Control Register */
#define MC32_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0063004u)

/** \\brief  6, Status Register */
#define MC32_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0063006u)

/** \\brief  8, Range Register, single address mode */
#define MC32_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0063008u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC32_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC32_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC32_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC32_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC32_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC32_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC32_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC32_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC32_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC32_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC32_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC32_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC32_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC32_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC32_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC32_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC32_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC32_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC32_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC32_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC32_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC32_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC32_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC32_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC32_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC32_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC32_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC32_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC32_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC32_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00630E6u)

