keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC43_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063BE8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC43_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063BEAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC43_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063BECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC43_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063BEEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC43_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063BA8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC43_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063BAAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC43_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063BACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC43_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063BAEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC43_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063BB0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC43_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063BB2u)

/** \\brief  C, Revision ID Register */
#define MC43_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0063B0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc44
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC44_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0063C00u)

/** \\brief  2, Configuration Register 1 */
#define MC44_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0063C02u)

/** \\brief  10, Memory ECC Detection Register */
#define MC44_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0063C10u)

/** \\brief  E, ECC Safety Register */
#define MC44_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF0063C0Eu)

/** \\brief  12, Error Tracking Register */
#define MC44_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063C12u)

/** \\brief  14, Error Tracking Register */
#define MC44_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063C14u)

/** \\brief  16, Error Tracking Register */
#define MC44_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063C16u)

/** \\brief  18, Error Tracking Register */
#define MC44_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063C18u)

/** \\brief  1A, Error Tracking Register */
#define MC44_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0063C1Au)

/** \\brief  4, MBIST Control Register */
#define MC44_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0063C04u)

/** \\brief  6, Status Register */
#define MC44_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0063C06u)

/** \\brief  8, Range Register, single address mode */
#define MC44_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0063C08u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC44_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CA0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC44_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CA2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC44_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CB4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC44_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CB6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC44_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CB8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC44_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CBAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC44_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CBCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC44_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CBEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC44_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CC0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC44_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CC2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC44_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CC4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC44_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CC6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC44_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CA4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC44_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CC8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC44_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CCAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC44_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CCCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC44_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CCEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC44_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CD0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC44_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CD2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC44_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CD4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC44_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CD6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC44_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CD8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC44_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CDAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC44_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CA6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC44_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CDCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC44_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CDEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC44_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CE0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC44_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CE2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC44_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CE4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC44_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0063CE6u)

