keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC51_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643E8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC51_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643EAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC51_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643ECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC51_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643EEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC51_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643A8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC51_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643AAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC51_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643ACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC51_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643AEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC51_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643B0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC51_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00643B2u)

/** \\brief  C, Revision ID Register */
#define MC51_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006430Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc52
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC52_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0064400u)

/** \\brief  2, Configuration Register 1 */
#define MC52_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0064402u)

/** \\brief  10, Memory ECC Detection Register */
#define MC52_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0064410u)

/** \\brief  E, ECC Safety Register */
#define MC52_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006440Eu)

/** \\brief  12, Error Tracking Register */
#define MC52_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064412u)

/** \\brief  14, Error Tracking Register */
#define MC52_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064414u)

/** \\brief  16, Error Tracking Register */
#define MC52_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064416u)

/** \\brief  18, Error Tracking Register */
#define MC52_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064418u)

/** \\brief  1A, Error Tracking Register */
#define MC52_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006441Au)

/** \\brief  4, MBIST Control Register */
#define MC52_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0064404u)

/** \\brief  6, Status Register */
#define MC52_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0064406u)

/** \\brief  8, Range Register, single address mode */
#define MC52_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0064408u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC52_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC52_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC52_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC52_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC52_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC52_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC52_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC52_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC52_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC52_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC52_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC52_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC52_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC52_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC52_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC52_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC52_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC52_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC52_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC52_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC52_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC52_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC52_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC52_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC52_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC52_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC52_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC52_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC52_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC52_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00644E6u)

