keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC55_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00647E8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC55_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00647EAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC55_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00647ECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC55_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00647EEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC55_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00647A8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC55_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00647AAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC55_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00647ACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC55_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00647AEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC55_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00647B0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC55_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00647B2u)

/** \\brief  C, Revision ID Register */
#define MC55_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006470Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc56
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC56_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0064800u)

/** \\brief  2, Configuration Register 1 */
#define MC56_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0064802u)

/** \\brief  10, Memory ECC Detection Register */
#define MC56_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0064810u)

/** \\brief  E, ECC Safety Register */
#define MC56_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006480Eu)

/** \\brief  12, Error Tracking Register */
#define MC56_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064812u)

/** \\brief  14, Error Tracking Register */
#define MC56_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064814u)

/** \\brief  16, Error Tracking Register */
#define MC56_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064816u)

/** \\brief  18, Error Tracking Register */
#define MC56_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064818u)

/** \\brief  1A, Error Tracking Register */
#define MC56_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006481Au)

/** \\brief  4, MBIST Control Register */
#define MC56_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0064804u)

/** \\brief  6, Status Register */
#define MC56_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0064806u)

/** \\brief  8, Range Register, single address mode */
#define MC56_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0064808u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC56_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC56_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC56_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC56_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC56_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC56_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC56_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC56_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC56_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC56_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC56_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC56_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC56_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC56_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC56_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC56_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC56_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC56_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC56_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC56_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC56_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC56_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC56_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC56_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC56_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC56_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC56_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC56_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC56_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC56_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00648E6u)

