keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC61_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DE8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC61_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DEAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC61_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC61_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DEEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC61_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DA8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC61_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DAAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC61_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC61_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DAEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC61_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DB0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC61_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064DB2u)

/** \\brief  C, Revision ID Register */
#define MC61_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0064D0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc62
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC62_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0064E00u)

/** \\brief  2, Configuration Register 1 */
#define MC62_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0064E02u)

/** \\brief  10, Memory ECC Detection Register */
#define MC62_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0064E10u)

/** \\brief  E, ECC Safety Register */
#define MC62_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF0064E0Eu)

/** \\brief  12, Error Tracking Register */
#define MC62_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064E12u)

/** \\brief  14, Error Tracking Register */
#define MC62_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064E14u)

/** \\brief  16, Error Tracking Register */
#define MC62_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064E16u)

/** \\brief  18, Error Tracking Register */
#define MC62_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064E18u)

/** \\brief  1A, Error Tracking Register */
#define MC62_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0064E1Au)

/** \\brief  4, MBIST Control Register */
#define MC62_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0064E04u)

/** \\brief  6, Status Register */
#define MC62_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0064E06u)

/** \\brief  8, Range Register, single address mode */
#define MC62_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0064E08u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC62_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064EA0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC62_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064EA2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC62_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064EB4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC62_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064EB6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC62_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064EB8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC62_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064EBAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC62_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064EBCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC62_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064EBEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC62_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064EC0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC62_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064EC2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC62_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064EC4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC62_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064EC6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC62_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064EA4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC62_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064EC8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC62_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064ECAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC62_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064ECCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC62_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064ECEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC62_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064ED0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC62_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064ED2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC62_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064ED4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC62_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064ED6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC62_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064ED8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC62_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064EDAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC62_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064EA6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC62_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064EDCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC62_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064EDEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC62_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064EE0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC62_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064EE2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC62_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064EE4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC62_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0064EE6u)

