keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC71_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657E8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC71_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657EAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC71_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657ECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC71_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657EEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC71_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657A8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC71_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657AAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC71_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657ACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC71_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657AEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC71_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657B0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC71_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00657B2u)

/** \\brief  C, Revision ID Register */
#define MC71_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF006570Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc72
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC72_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0065800u)

/** \\brief  2, Configuration Register 1 */
#define MC72_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0065802u)

/** \\brief  10, Memory ECC Detection Register */
#define MC72_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0065810u)

/** \\brief  E, ECC Safety Register */
#define MC72_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF006580Eu)

/** \\brief  12, Error Tracking Register */
#define MC72_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065812u)

/** \\brief  14, Error Tracking Register */
#define MC72_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065814u)

/** \\brief  16, Error Tracking Register */
#define MC72_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065816u)

/** \\brief  18, Error Tracking Register */
#define MC72_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065818u)

/** \\brief  1A, Error Tracking Register */
#define MC72_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF006581Au)

/** \\brief  4, MBIST Control Register */
#define MC72_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0065804u)

/** \\brief  6, Status Register */
#define MC72_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0065806u)

/** \\brief  8, Range Register, single address mode */
#define MC72_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0065808u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC72_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658A0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC72_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658A2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC72_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658B4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC72_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658B6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC72_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658B8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC72_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658BAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC72_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658BCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC72_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658BEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC72_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658C0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC72_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658C2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC72_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658C4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC72_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658C6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC72_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658A4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC72_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658C8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC72_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658CAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC72_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658CCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC72_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658CEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC72_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658D0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC72_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658D2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC72_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658D4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC72_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658D6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC72_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658D8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC72_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658DAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC72_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658A6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC72_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658DCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC72_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658DEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC72_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658E0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC72_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658E2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC72_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658E4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC72_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF00658E6u)

