keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC75_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BE8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC75_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BEAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC75_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC75_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BEEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC75_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BA8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC75_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BAAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC75_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC75_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BAEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC75_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BB0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC75_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065BB2u)

/** \\brief  C, Revision ID Register */
#define MC75_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0065B0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc76
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC76_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0065C00u)

/** \\brief  2, Configuration Register 1 */
#define MC76_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0065C02u)

/** \\brief  10, Memory ECC Detection Register */
#define MC76_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0065C10u)

/** \\brief  E, ECC Safety Register */
#define MC76_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF0065C0Eu)

/** \\brief  12, Error Tracking Register */
#define MC76_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065C12u)

/** \\brief  14, Error Tracking Register */
#define MC76_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065C14u)

/** \\brief  16, Error Tracking Register */
#define MC76_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065C16u)

/** \\brief  18, Error Tracking Register */
#define MC76_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065C18u)

/** \\brief  1A, Error Tracking Register */
#define MC76_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065C1Au)

/** \\brief  4, MBIST Control Register */
#define MC76_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0065C04u)

/** \\brief  6, Status Register */
#define MC76_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0065C06u)

/** \\brief  8, Range Register, single address mode */
#define MC76_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0065C08u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC76_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CA0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC76_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CA2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC76_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CB4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC76_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CB6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC76_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CB8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC76_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CBAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC76_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CBCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC76_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CBEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC76_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CC0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC76_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CC2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC76_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CC4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC76_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CC6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC76_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CA4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC76_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CC8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC76_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CCAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC76_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CCCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC76_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CCEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC76_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CD0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC76_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CD2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC76_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CD4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC76_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CD6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC76_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CD8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC76_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CDAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC76_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CA6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC76_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CDCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC76_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CDEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC76_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CE0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC76_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CE2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC76_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CE4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC76_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CE6u)

