keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxMc_reg.h
/** \\brief  E8, Read Data and Bit Flip Register */
#define MC76_RDBFL36 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CE8u)

/** \\brief  EA, Read Data and Bit Flip Register */
#define MC76_RDBFL37 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CEAu)

/** \\brief  EC, Read Data and Bit Flip Register */
#define MC76_RDBFL38 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CECu)

/** \\brief  EE, Read Data and Bit Flip Register */
#define MC76_RDBFL39 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CEEu)

/** \\brief  A8, Read Data and Bit Flip Register */
#define MC76_RDBFL4 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CA8u)

/** \\brief  AA, Read Data and Bit Flip Register */
#define MC76_RDBFL5 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CAAu)

/** \\brief  AC, Read Data and Bit Flip Register */
#define MC76_RDBFL6 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CACu)

/** \\brief  AE, Read Data and Bit Flip Register */
#define MC76_RDBFL7 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CAEu)

/** \\brief  B0, Read Data and Bit Flip Register */
#define MC76_RDBFL8 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CB0u)

/** \\brief  B2, Read Data and Bit Flip Register */
#define MC76_RDBFL9 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065CB2u)

/** \\brief  C, Revision ID Register */
#define MC76_REVID /*lint --e(923)*/ (*(volatile Ifx_MC_REVID*)0xF0065C0Cu)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Mc_Cfg_Mc77
 * \{  */

/** \\brief  0, Configuration Register 0 */
#define MC77_CONFIG0 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG0*)0xF0065D00u)

/** \\brief  2, Configuration Register 1 */
#define MC77_CONFIG1 /*lint --e(923)*/ (*(volatile Ifx_MC_CONFIG1*)0xF0065D02u)

/** \\brief  10, Memory ECC Detection Register */
#define MC77_ECCD /*lint --e(923)*/ (*(volatile Ifx_MC_ECCD*)0xF0065D10u)

/** \\brief  E, ECC Safety Register */
#define MC77_ECCS /*lint --e(923)*/ (*(volatile Ifx_MC_ECCS*)0xF0065D0Eu)

/** \\brief  12, Error Tracking Register */
#define MC77_ETRR0 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065D12u)

/** \\brief  14, Error Tracking Register */
#define MC77_ETRR1 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065D14u)

/** \\brief  16, Error Tracking Register */
#define MC77_ETRR2 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065D16u)

/** \\brief  18, Error Tracking Register */
#define MC77_ETRR3 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065D18u)

/** \\brief  1A, Error Tracking Register */
#define MC77_ETRR4 /*lint --e(923)*/ (*(volatile Ifx_MC_ETRR*)0xF0065D1Au)

/** \\brief  4, MBIST Control Register */
#define MC77_MCONTROL /*lint --e(923)*/ (*(volatile Ifx_MC_MCONTROL*)0xF0065D04u)

/** \\brief  6, Status Register */
#define MC77_MSTATUS /*lint --e(923)*/ (*(volatile Ifx_MC_MSTATUS*)0xF0065D06u)

/** \\brief  8, Range Register, single address mode */
#define MC77_RANGE /*lint --e(923)*/ (*(volatile Ifx_MC_RANGE*)0xF0065D08u)

/** \\brief  A0, Read Data and Bit Flip Register */
#define MC77_RDBFL0 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DA0u)

/** \\brief  A2, Read Data and Bit Flip Register */
#define MC77_RDBFL1 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DA2u)

/** \\brief  B4, Read Data and Bit Flip Register */
#define MC77_RDBFL10 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DB4u)

/** \\brief  B6, Read Data and Bit Flip Register */
#define MC77_RDBFL11 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DB6u)

/** \\brief  B8, Read Data and Bit Flip Register */
#define MC77_RDBFL12 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DB8u)

/** \\brief  BA, Read Data and Bit Flip Register */
#define MC77_RDBFL13 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DBAu)

/** \\brief  BC, Read Data and Bit Flip Register */
#define MC77_RDBFL14 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DBCu)

/** \\brief  BE, Read Data and Bit Flip Register */
#define MC77_RDBFL15 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DBEu)

/** \\brief  C0, Read Data and Bit Flip Register */
#define MC77_RDBFL16 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DC0u)

/** \\brief  C2, Read Data and Bit Flip Register */
#define MC77_RDBFL17 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DC2u)

/** \\brief  C4, Read Data and Bit Flip Register */
#define MC77_RDBFL18 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DC4u)

/** \\brief  C6, Read Data and Bit Flip Register */
#define MC77_RDBFL19 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DC6u)

/** \\brief  A4, Read Data and Bit Flip Register */
#define MC77_RDBFL2 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DA4u)

/** \\brief  C8, Read Data and Bit Flip Register */
#define MC77_RDBFL20 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DC8u)

/** \\brief  CA, Read Data and Bit Flip Register */
#define MC77_RDBFL21 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DCAu)

/** \\brief  CC, Read Data and Bit Flip Register */
#define MC77_RDBFL22 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DCCu)

/** \\brief  CE, Read Data and Bit Flip Register */
#define MC77_RDBFL23 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DCEu)

/** \\brief  D0, Read Data and Bit Flip Register */
#define MC77_RDBFL24 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DD0u)

/** \\brief  D2, Read Data and Bit Flip Register */
#define MC77_RDBFL25 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DD2u)

/** \\brief  D4, Read Data and Bit Flip Register */
#define MC77_RDBFL26 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DD4u)

/** \\brief  D6, Read Data and Bit Flip Register */
#define MC77_RDBFL27 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DD6u)

/** \\brief  D8, Read Data and Bit Flip Register */
#define MC77_RDBFL28 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DD8u)

/** \\brief  DA, Read Data and Bit Flip Register */
#define MC77_RDBFL29 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DDAu)

/** \\brief  A6, Read Data and Bit Flip Register */
#define MC77_RDBFL3 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DA6u)

/** \\brief  DC, Read Data and Bit Flip Register */
#define MC77_RDBFL30 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DDCu)

/** \\brief  DE, Read Data and Bit Flip Register */
#define MC77_RDBFL31 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DDEu)

/** \\brief  E0, Read Data and Bit Flip Register */
#define MC77_RDBFL32 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DE0u)

/** \\brief  E2, Read Data and Bit Flip Register */
#define MC77_RDBFL33 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DE2u)

/** \\brief  E4, Read Data and Bit Flip Register */
#define MC77_RDBFL34 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DE4u)

/** \\brief  E6, Read Data and Bit Flip Register */
#define MC77_RDBFL35 /*lint --e(923)*/ (*(volatile Ifx_MC_RDBFL*)0xF0065DE6u)

